In [22]:
import numpy as np
import pandas as pd

In [23]:

df_time=pd.read_csv(r"A:\Work Docs\DATA Set\messages.csv")
df_date=pd.read_csv(r"A:\Work Docs\DATA Set\orders.csv")

In [24]:
df_time.sample()

                    date                           msg
508  2015-09-28 22:47:00  поцелую женщине...0666608116

In [25]:
df_date.sample()

           date  product_id  city_id  orders
942  2019-11-16        2999        7       1

By default data type of date and time is object

we have to concert it to datatype as date and time

In [26]:
df_date.info()
#date        1000 non-null   object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [27]:
df_time.info()
# 0   date    1000 non-null   object

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# Working With Dates

In [28]:
# Converting data type from string to date-time
df_date['date']=pd.to_datetime(df_date['date'])
df_date.info()
# 0   date        1000 non-null   datetime64[ns]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [29]:
# Converting data type from string to date-time
df_time['date']=pd.to_datetime(df_time['date'])
df_time.info()
#  0   date    1000 non-null   datetime64[ns]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

Extract year,month,day

In [31]:
df_date['Date_year']=df_date['date'].dt.year
df_date['Date_month']=df_date['date'].dt.month
df_date['Date_month_name']=df_date['date'].dt.month_name()
df_date['Date_day']=df_date['date'].dt.day
df_date['Date_day_name']=df_date['date'].dt.day_name()


df_date.sample(5)

,date,product_id,city_id,orders,Date_year,Date_month,Date_day,Date_month_name,Date_day_name
144,2019-10-14,5778,24,108,2019,10,14,October,Monday
87,2019-07-12,7042,3,5,2019,7,12,July,Friday
172,2019-06-24,5450,13,1,2019,6,24,June,Monday
547,2019-06-21,793,29,3,2019,6,21,June,Friday
236,2018-08-24,4576,22,3,2018,8,24,August,Friday

Day of week, month,year

In [32]:
df_date['Date_day_of_week']=df_date['date'].dt.day_of_week
df_date['Date_day_of_month']=df_date['date'].dt.day_of_year
df_date['Date_day_of_year']=df_date['date'].dt.day_of_year



df_date.sample(5)

,date,product_id,city_id,orders,Date_year,Date_month,Date_day,Date_month_name,Date_day_name,Date_day_of_week,Date_day_of_month,Date_day_of_year
737,2019-04-24,668,2,3,2019,4,24,April,Wednesday,2,114,114
942,2019-11-16,2999,7,1,2019,11,16,November,Saturday,5,320,320
817,2019-10-20,3271,0,1,2019,10,20,October,Sunday,6,293,293
932,2019-07-19,6390,0,1,2019,7,19,July,Friday,4,200,200
325,2019-06-13,7057,2,6,2019,6,13,June,Thursday,3,164,164

Is Weekend?

In [37]:
df_date['date_is_weekend']=np.where(df_date['Date_day_name'].isin(['Sunday','Saturday']),1,0) 



df_date.sample(5)

,date,product_id,city_id,orders,Date_year,Date_month,Date_day,Date_month_name,Date_day_name,Date_day_of_week,Date_day_of_month,Date_day_of_year,date_is_weekend
234,2019-04-21,5200,28,19,2019,4,21,April,Sunday,6,111,111,1
129,2018-12-06,7413,13,6,2018,12,6,December,Thursday,3,340,340,0
669,2018-10-31,1647,4,1,2018,10,31,October,Wednesday,2,304,304,0
468,2019-02-14,7140,18,20,2019,2,14,February,Thursday,3,45,45,0
629,2019-01-15,7138,28,1,2019,1,15,January,Tuesday,1,15,15,0

Exctract Quator,samester

In [41]:
df_date['Date_Quater']=df_date['date'].dt.quarter




df_date.sample(5)

SyntaxError: invalid syntax. Perhaps you forgot a comma? (4264278728.py, line 2)

In [42]:
df_date['Semester']=np.where(df_date['Date_Quater'].isin([1,2]),1,2)
df_date.sample(5)

,date,product_id,city_id,orders,Date_year,Date_month,Date_day,Date_month_name,Date_day_name,Date_day_of_week,Date_day_of_month,Date_day_of_year,date_is_weekend,Date_Quater,Date_semester,Semester
208,2019-06-24,3919,2,22,2019,6,24,June,Monday,0,175,175,0,2,175,1
552,2019-02-04,5955,16,3,2019,2,4,February,Monday,0,35,35,0,1,35,1
12,2019-03-15,5665,5,1,2019,3,15,March,Friday,4,74,74,0,1,74,1
265,2019-04-28,2850,16,6,2019,4,28,April,Sunday,6,118,118,1,2,118,1
548,2019-11-03,5917,2,59,2019,11,3,November,Sunday,6,307,307,1,4,307,2

Extract Time elapsed between dates

In [44]:
import datetime
today =datetime.datetime.today()

today

datetime.datetime(2023, 9, 6, 18, 6, 16, 858707)

In [45]:
today-df_date['date']

0     1366 days 18:06:16.858707
1     1848 days 18:06:16.858707
2     1779 days 18:06:16.858707
3     1481 days 18:06:16.858707
4     1704 days 18:06:16.858707
                 ...
995   1794 days 18:06:16.858707
996   1735 days 18:06:16.858707
997   1583 days 18:06:16.858707
998   1648 days 18:06:16.858707
999   1422 days 18:06:16.858707
Name: date, Length: 1000, dtype: timedelta64[ns]

In [47]:
#month passed
np.round((today-df_date['date'])/np.timedelta64(1,'M'),0)

0      44.0
1      60.0
2      57.0
3      48.0
4      55.0
       ...
995    58.0
996    56.0
997    51.0
998    53.0
999    46.0
Name: date, Length: 1000, dtype: float64

# Time

In [48]:
df_time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

Extract date and time

In [53]:
df_time['time']=df_time['date'].dt.time
df_time['hour']=df_time['date'].dt.hour
df_time['mins']=df_time['date'].dt.minute
df_time['sec']=df_time['date'].dt.second

df_time.sample(5)

,date,msg,hour,mins,sec,time
476,2015-08-12 00:34:00,приглашаю дев сем пару прогулятся по набережно...,0,34,0,00:34:00
589,2012-12-27 23:49:00,Користувач РЭД проголосував ЗА кліп Валерий Ме...,23,49,0,23:49:00
317,2013-10-13 00:00:00,щедр красив умен и богат на своем авто! Нуж...,0,0,0,00:00:00
398,2012-11-29 00:12:00,"Бесит что не умею говорить \нет\"" там где ст...",0,12,0,00:12:00
300,2014-08-28 00:16:00,МУЖЧИНА ПОЗНАКОМИТСЯ С ЖЕНЩИНОЙ 34-42 ДЛЯ И.О....,0,16,0,00:16:00

Time Difference

In [55]:
today-df_time['date']

0     3552 days 17:16:16.858707
1     3416 days 18:26:16.858707
2     3902 days 17:45:16.858707
3     3204 days 17:35:16.858707
4     3601 days 18:55:16.858707
                 ...
995   4191 days 17:16:16.858707
996   3512 days 18:52:16.858707
997   3977 days 18:29:16.858707
998   4093 days 18:32:16.858707
999   3365 days 18:41:16.858707
Name: date, Length: 1000, dtype: timedelta64[ns]

Time difference in seceonds

np.timedelta64(1,'s')

In [57]:
(today-df_time['date'])/np.timedelta64(1,'s')

0      3.069550e+08
1      2.952088e+08
2      3.371967e+08
3      2.768889e+08
4      3.111945e+08
           ...
995    3.621646e+08
996    3.035047e+08
997    3.436794e+08
998    3.537019e+08
999    2.908033e+08
Name: date, Length: 1000, dtype: float64

Time difference in min

np.timedelta64(1,'m')

In [58]:
(today-df_time['date'])/np.timedelta64(1,'m')

0      5.115916e+06
1      4.920146e+06
2      5.619945e+06
3      4.614815e+06
4      5.186575e+06
           ...
995    6.036076e+06
996    5.058412e+06
997    5.727989e+06
998    5.895032e+06
999    4.846721e+06
Name: date, Length: 1000, dtype: float64